{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 210], "use_bias": true, "trainable": true, "name": "fc1", "kernel_constraint": null, "units": 30, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "name": "fc2", "kernel_constraint": null, "units": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "name": "out", "kernel_constraint": null, "units": 1}, "class_name": "Dense"}], "keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Sequential"}