{"config": [{"config": {"batch_input_shape": [null, 210], "dtype": "float32", "name": "fc1", "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 30, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.6, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "fc2", "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "out", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Sequential"}